story-map.org
#+html_head: <link rel="stylesheet" href="css/org-page.css"/>
#+title: Story Map

* [note]
- do not count `.field` in function application syntax
  and handle stack functions specially
- learn more about float encoding
- dive deep into c++ standard lib
- learn from nodejs and python about prelude
* core
  - an interpreter implemented by dynamic threaded code
* macro system
  - with lisp like macro system
*** (~>)
*** (vect~>)
*** (list~>)
*** (cond)
*** (match)
*** (if)
*** (partquote)
*** (= <name> (macro))
* object system
  - with object system
*** inheriting types
*** summing types
* ffi
  - with simple ffi to c++
*** handle ffi by dynamic library
* prelude
  - with a practical prelude
*** load module from system -- by $PATH
*** first set of prelude functions are about list processing
*** str lib
*** container lib
*** stream lib
*** fs lib
*** network lib
*** git lib
* module system
  - with simple module system
*** `env_eq` -- for module_o::eq
*** do not reload module -- need to use module cache
* secure
*** can not handle big file -- due to the recursion in sexp parser
*** make syntax frontend more secure
* toolchain
*** debug
*** profile
*** repl
*** package manager
*** editing support
***** jojo-mode
***** org-mode for neovim
* documentation
  - well documented
*** renew old notes
*** renew ideas form jojo-history
* apps
  - with some good applications written in it
*** jojo-bch
    - compile a subset of jojo to bch opcode
*** org-mode parser
*** git-dir parser
*** xml/html generator
* community
  - maintained by a community as a live system
